[
	{
		"id": 1,
		"technologyIds": [
			1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
			27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
			50, 51, 52
		],
		"description": "Development of an AI-supported language learning platform that enables users to learn new languages. The app offers interaction with AI chatbots that generate and correct answers based on user input. A spaced repetitive learning algorithm ensures efficient vocabulary training. The app is published on the web, iOS, and Android.",
		"tasks": [
			"Conception and implementation of the software architecture for the cross-platform app Chatsprint.",
			"Development of the app with Capacitor.js and React based on a Figma design and styling with SCSS modules.",
			"Global and asynchronous state management with Jotai and TanstackQuery.",
			"Implementation of a demo app with React Native and SQLite for a quick showcase.",
			"Development of authentication forms with React-Hook-Form, including client-side validation with Yup.",
			"Setting up Storybook for documentation, visualization, and testing of components.",
			"Testing the business logic with Jest and writing E2E tests with Playwright and MSW.",
			"Creating HTML emails with MJML for consistent display in various email clients.",
			"Implementation of an authentication system according to OAuth 2.0 with AWS Cognito as Identity Provider.",
			"Hosting the web version of the app via AWS Amplify.",
			"Developing Lambda functions in Python for communication between frontend, backend, and AWS Cognito.",
			"Developing the backend with .NET and logging with Serilog with AWS CloudWatch integration.",
			"Writing unit tests with NUnit and mocking with NSubstitute to ensure backend quality.",
			"Design and implementation of the database structure with AWS RDS PostgreSQL and Entity Framework.",
			"Setting up a Directus Docker image on AWS ECS as a headless CMS.",
			"Setting up Mapperly in .NET for Model-DTO mapping.",
			"Connecting and integrating Google Analytics via Firebase for web and native apps.",
			"Setting up the AWS Parameter Store and integrating it into .NET for secure storage of sensitive data.",
			"Creating and managing SSL certificates for custom domains.",
			"Managing and configuring domains, including DNS settings and subdomains.",
			"Implementing a payment system with Stripe for web and RevenueCat for in-app purchases.",
			"Publishing the app in the stores (Google Play Console and App Store Connect).",
			"Developing endpoints for the Chat GPT Completion API integration.",
			"Connecting an AWS S3 bucket for dynamic content and publicly accessible email images.",
			"Dockerization of the backend for deployment on AWS ECS (Fargate).",
			"Creating Dockerfiles and Docker Compose configurations for build and deployment automation.",
			"Implementing CI/CD pipelines with GitHub Actions for tests and automated deployments.",
			"Introducing pre-commit hooks with Husky for ESLint and code formatting.",
			"Developing build and versioning scripts for web, iOS, and Android.",
			"Conception and implementation of release strategies.",
			"Project management with YouTrack and a customized SCRUM approach."
		],
		"customer": "Glowbyte GmbH",
		"metadata": [
			{
				"start": "07/2023",
				"end": "02/2025",
				"role": "Technical Lead"
			}
		]
	},
	{
		"id": 2,
		"technologyIds": [1, 2, 4, 10, 11, 23, 24, 28, 51, 52, 53],
		"description": "Development and optimization of the customers website, focusing on performance, testability, and the integration of a headless CMS.",
		"tasks": [
			"Development of frontend components with Next.js, based on a headless CMS (Drupal).",
			"Styling the components with CSS modules and SASS/SCSS for a modular and maintainable design.",
			"Implementing a dealer locator with Here-Map, including displaying locations on interactive maps.",
			"Developing auto-suggestion features with Here-Map for automatic address completion.",
			"Performing performance optimizations to improve loading times.",
			"Creating and conducting end-to-end tests (E2E) with Playwright.",
			"Conception and implementation of a comprehensive test strategy.",
			"Setting up Storybook for visual documentation and improved teamwork.",
			"Testing the business logic and components with Jest.",
			"Replacing Redux with TanstackQuery and Jotai for improved state management."
		],
		"customer": "Mercedes-Benz Group AG",
		"metadata": [
			{
				"start": "04/2023",
				"end": "07/2023",
				"role": "Lead Frontend Developer"
			},
			{
				"start": "08/2021",
				"end": "03/2022",
				"role": "Frontend Developer"
			}
		]
	},
	{
		"id": 3,
		"technologyIds": [1, 54, 55, 56, 36, 57],
		"description": "Development of software for creating employee profiles that can be used for project applications.",
		"tasks": [
			"Conception and implementation of the frontend architecture with Angular and PrimeNG.",
			"Development and styling of frontend components with TypeScript and PrimeNG, including responsive designs.",
			"Integration of the backend with the frontend for storing employee data in AWS DynamoDB.",
			"Connecting an AWS S3 bucket for managing profile pictures.",
			"Optimizing data persistence and API communication with AWS DynamoDB and AWS S3.",
			"Implementing a feature with the Google Docs API for profile generation based on templates with export options."
		],
		"customer": "Rockstardevelopers GmbH",
		"metadata": [
			{
				"start": "01/2023",
				"end": "03/2023",
				"role": "Frontend Developer"
			}
		]
	},
	{
		"id": 4,
		"technologyIds": [1, 2, 4, 58, 7, 59, 60, 10],
		"description": "Implementation of an authentication system for the customers website, based on OAuth 2.0, focusing on user-friendliness and security.",
		"tasks": [
			"Setting up Auth0 as Identity Provider (IdP) for user authentication.",
			"Developing forms for login, registration, and password reset with Forms.io and Yup.",
			"Implementing the login and registration system according to OAuth 2.0 standards.",
			"Styling and optimizing the frontend components with SCSS."
		],
		"customer": "HiPP GmbH & Co. Vertrieb KG",
		"metadata": [
			{
				"start": "10/2022",
				"end": "12/2022",
				"role": "Frontend Developer"
			}
		]
	},
	{
		"id": 5,
		"technologyIds": [61, 1, 23, 28, 10, 8, 62, 63, 64],
		"description": "Development and optimization of a modular frontend UI library that served to standardize and reuse components in the project. The library was created as part of a master's thesis, with a special focus on accessibility (WCAG compliance), flexibility, and user-friendliness.",
		"tasks": [
			"Conception and development of reusable UI components with Svelte and TypeScript.",
			"Implementation and maintenance of Storybook for documentation and visualization.",
			"Performing unit tests with Jest for code quality assurance.",
			"Ensuring compliance with accessibility standards (WCAG/BITV 2.0) with automatic contrast calculations.",
			"Developing a responsive design with SASS/SCSS and interactive features with Swiper.js.",
			"Integrating a CI/CD process with Bitbucket for continuous deployments.",
			"Introducing a centralized component library for efficient development times.",
			"Improving user-friendliness and accessibility through WCAG standards.",
			"Promoting teamwork and efficiency through documentation and Storybook.",
			"Successful use of the UI library at Freudenberg SE."
		],
		"customer": "Rockstardevelopers GmbH",
		"metadata": [
			{
				"start": "04/2022",
				"end": "09/2022",
				"role": "Frontend Developer"
			}
		]
	},
	{
		"id": 6,
		"technologyIds": [14, 15, 65, 16, 66, 26, 82, 67, 49, 68, 69, 70, 71],
		"description": "Development and enhancement of an order management software for planning and processing orders. Special requirements included the integration of SAP data, user management via LDAP and Active Directory, as well as a customizable interface with PDF generation.",
		"tasks": [
			"Conceptualization of the data structure in MSSQL, considering SAP integration.",
			"Creation of Database-First migrations with Entity Framework.",
			"Extension of the existing data structure in MSSQL for new requirements.",
			"Implementation of a .NET API with versioning and Swagger documentation.",
			"Development of an authentication system with IdentityServer 4 according to OAuth 2.0.",
			"Development and implementation of new API endpoints.",
			"Development of frontend views with DevExpress with customer-specific sorting and filtering functions.",
			"Styling of the frontend components with CSS according to customer branding.",
			"Generation of order confirmations in PDF format with DevExpress.",
			"Writing unit tests with NUnit and data mocking with FakeItEasy.",
			"Conception of rule sets for quality assurance with SonarQueue and Roslyn.",
			"Implementation of a pipeline for integration tests in Jenkins with Groovy.",
			"Writing file-based logs with Serilog.",
			"Conceptualization and coordination of new requirements with the customer.",
			"Project management and version control with Redmine and Git."
		],
		"customer": "Continental AG",
		"metadata": [
			{
				"start": "02/2021",
				"end": "08/2021",
				"role": "Technical Lead"
			},
			{
				"start": "01/2019",
				"end": "02/2020",
				"role": "Fullstack Developer"
			}
		]
	},
	{
		"id": 7,
		"technologyIds": [14, 15, 72, 16, 66, 70, 71],
		"description": "Development of roadmap planning software for the project management of internal projects of the customer.",
		"tasks": [
			"Conception and extension of the data structure in MSSQL for roadmap planning.",
			"Creation of Database-First migrations with Entity Framework.",
			"Implementation of new frontend features with Telerik Kendo UI and CSS."
		],
		"customer": "Infineon Technologies AG",
		"metadata": [
			{
				"start": "11/2020",
				"end": "02/2021",
				"role": "Fullstack Developer"
			}
		]
	},
	{
		"id": 8,
		"technologyIds": [14, 73, 16, 26, 82, 68, 74, 49, 15, 70, 71],
		"description": "Development of an API for communication between the frontend, a timeseries database, and a file server.",
		"tasks": [
			"Conceptualization and design of a new data structure in PostgreSQL to map the Python module management.",
			"Creation of Code-First migrations with Entity Framework for flexible implementation and further development of the database.",
			"Development of a code generator for CRUD endpoints in ASP.NET Core to automate repeatable processes and accelerate development.",
			"Implementation of unit tests with NUnit and FakeItEasy to test the API functionality and identify errors early.",
			"Documentation of the API using Swagger and Swashbuckle to provide a clear and complete overview of the available endpoints.",
			"Writing file-based logs with Serilog to ensure seamless logging and traceability of backend activities."
		],
		"customer": "Gefasoft Engineering GmbH",
		"metadata": [
			{
				"start": "10/2020",
				"end": "11/2020",
				"role": "Backend Developer"
			}
		]
	},
	{
		"id": 9,
		"technologyIds": [14, 12, 16, 26, 82, 75, 76],
		"description": "Development of an event-driven Microsoft service for an order management software.",
		"tasks": [
			"Design and implementation of a data structure for audit data with SQLite to ensure the traceability and evaluation of orders.",
			"Creation of Code-First migrations with Entity Framework for structured management of the database.",
			"Conception of complex logic with UML design and implementation in .NET Core to automate the processing of XML orders.",
			"Performing performance optimizations with multi-threading to efficiently process multiple orders simultaneously and improve overall system performance.",
			"Implementation of unit tests with NUnit and FakeItEasy to ensure the functionality and reliability of the backend components.",
			"Writing file-based logs with log4net to enable seamless logging and analysis of processes."
		],
		"customer": "BMW AG",
		"metadata": [
			{
				"start": "06/2020",
				"end": "10/2020",
				"role": "Backend Developer"
			}
		]
	},
	{
		"id": 10,
		"technologyIds": [77, 78],
		"description": "Investigation of the HTM (Hierarchical Temporal Memory) algorithm, an AI technology from Numenta.",
		"tasks": [
			"Integration of the htm.core implementation of the HTM algorithm from Numenta into the research project.",
			"Development of a test environment in C++ that visualized the results of the algorithm in the console to interpret the behavior of the parameters and their effects on learning.",
			"Analysis and documentation of the results in the form of a bachelor's thesis, which details the methodology, the experiments, and the learning behavior of the various parameters of the Temporal Memory part of the algorithm."
		],
		"customer": "Gefasoft Engineering GmbH",
		"metadata": [
			{
				"start": "02/2020",
				"end": "06/2020",
				"role": "Research Work"
			}
		]
	},
	{
		"id": 11,
		"technologyIds": [14, 73, 16, 79, 80, 81, 26, 82, 76, 15, 70, 71],
		"description": "Development of interfaces and a web app for an iOS messenger app with alarm and event broadcasting function.",
		"tasks": [
			"Development of a REST API with ASP.NET Core that communicated with an Ejabberd server via XMPP and implemented a Pub/Sub pattern.",
			"Creation of REST endpoints for data communication with the iOS app to reliably transmit alarms and events.",
			"Development of a web app to manage escalation matrices, which made it possible to send alarms to different employees at decreasing time intervals.",
			"Implementation of a calendar system to manage employees in shift operations and control alarm forwarding according to availabilities.",
			"Sending verification emails via SMTP for user verification and communication.",
			"Integration of Apple Push Notifications in the .NET backend to send alarms directly to iOS devices.",
			"Implementation of a configurable file-based logging system with log4net to create detailed logs for analysis and troubleshooting purposes."
		],
		"customer": "BMW AG",
		"metadata": [
			{
				"start": "08/2018",
				"end": "12/2018",
				"role": "Fullstack Developer"
			}
		]
	},
	{
		"id": 12,
		"technologyIds": [2, 4, 83, 54, 84, 85, 86, 87, 23, 24, 71, 10, 88, 89, 55, 1, 70, 90, 28, 62],
		"description": "Consulting and development for a DAX-listed industrial group.",
		"tasks": [
			"Development of new features in React, Next.js, and Angular.",
			"Development of design components and integration into Storybook.",
			"Development of E2E tests with Playwright.",
			"Development of unit tests with Jest.",
			"Implementation of search indexes and filters for optimized search queries in Atlas Mongo DB.",
			"Implementation of data tables with PrimeNG.",
			"Development of new pages and components based on Figma designs using Tailwind.",
			"Optimization of components and ensuring compliance with WCAG guidelines.",
			"Optimization of pages for screen readers."
		],
		"customer": "DAX-listed industrial group",
		"metadata": [
			{
				"start": "02/2025",
				"end": "06/2025",
				"role": "Full Stack Developer"
			}
		]
	}
]
